#ifndef BLUETOOTH_H
#define BLUETOOTH_H

#include "main.h" // Подключаем для типов данных и HAL

// ==============================================================================
// ЭКСПОРТ ГЛОБАЛЬНЫХ ПЕРЕМЕННЫХ
// ==============================================================================
extern uint8_t str;              // Текущая принятая команда по Bluetooth
extern uint32_t now_getBTcommand;// Таймер последнего приема команды
extern uint8_t uart_tx_busy;     // Флаг занятости линии отправки UART2

// ==============================================================================
// ПРОТОТИПЫ ФУНКЦИЙ
// ==============================================================================
void BTcommandIsActive(void);
void execute_bt_command(void);

#endif /* BLUETOOTH_H */
